#ცვლადის შესაქმნელად საჭიროა 3 ნაბიჯი 

#step 1 თუ გვჭირდება ასაკის ასახვა მაგალითად მე ვარ 13 წლის და გვინდა ავსახოთ ცვლადის გამოყენებით 
#age = (13) #გამოვა ასე ანუ როდესაც დაგვჭირდება ასაკის მითიტება დავწერთ name და ტერმინალი გამოიტანს 13-ს

#step 2 არის მნიშვნელობის მინიჭება ანუ ამ შემთხვევაში = მეშვეობით ვაკავშირებთ ცვლადი სხვადასხვა ტიპის მონაცემებს 

#step 3 როდესაც წინა 2 ნაბიჯს დავასრულებთ შეგვიძლია = ის მერე ჩავწეროთ ჩვენთვის სასურველი მონაცემი როგორც ჩვენი მაგალითი იყო age = (13) როდესაც დავწერთ age-ს მაშინ უკვე ტერმინალში აისახება 13


#ცვლადები 

num1 = 12
num2 = 29
num3 = 4

print(num1)
print(num2)
print(num3)

print((num1) + (num2) + (num3))

#x და y ნამრავლი

x = 80
y = 10
print( x * y)

x = 99
y = 12
print(x * y)

x = 23
y = 20
print(x * y)

#მართკუთხედის პერიმეტრის გამოთვლა length and width

length = 20
width = 10

print((length) + (width) + (length) + (width))

