#მოკლედ sequence წესით არის მონაცემთა ტიპი რომელიც ლაგდება თანმიმდევრობით 
#iteration არის ბევრჯერ განმეორებადi იგივე loop
#selection არის არჩევანი if else და ასე შემდეგ

# მომხმარებლისგან პროდუქტის ფასის შეყვანა
price = int(input("შეიყვანეთ პროდუქტის ფასი: "))

# ფასდაკლების განსაზღვრა და საბოლოო ფასის გამოთვლა
if price > 50:
    discount = price * 0.10
    final_price = price - discount
    print("პროდუქტზე გამოყენებულია 10%-იანი ფასდაკლება. საბოლოო ფასი: {final_price} ლარი")
elif 20 <= price <= 50:
    discount = price * 0.05
    final_price = price - discount
    print("პროდუქტზე გამოყენებულია 5%-იანი ფასდაკლება. საბოლოო ფასი: {final_price} ლარი")
else:
    print("ფასდაკლება არ გამოიყენება. საბოლოო ფასი: {price} ლარი")
